-- 형변환, 기타함수 실습
       
-- 실습 : 사원병, 급여 조회함. 급여에 출력서식 적용 : to_char
-- 앞에 통화단위 표시하고, 천단위 구분기호 사용
  

-- 직급이 'J7'인 직원들의 사원명, 입사일 조회
-- 입사일은 '2014년 8월 22일'의 형태로 출력 처리함.
   

-- 직급이 'J7'인 직원들의 생년월일, 나이 조회



-- 주민번호 앞 6자리 값과 뒤 7자리값을 더한 결과 조회



-- 보너스 포인트, 보너스 포인트가 널이면 0으로 바꾼 결과, 
-- 보너스 포인트가 널이면 1로 널이 아니면 0.5로 바꾼 결과 조회
 

-- 사원명, 성별 조회
-- 주민번호 - 다음인 8번째 값이 1, 3 이면 '남', 아니면 '여' 로 출력 처리
   

-- 직원의 관리자사번(MGR_ID)이 널이면 '관리자없음'을 선택하고,
--  널이 아니면 기록된값을 그대로 사용함.



-- 직급별 급여 인상분이 다를 때 

    

-- 사번, 직급코드, 급여, 급여 인상분이 적용된 급여 조회
-- 별칭은 인상급여
-- 직급코드가 'J7'이면 급여의 1.2, 'J6'이면 1.15, 'J5'이면 1.1,
-- 나머지는 1.05 적용
-- CASE 표현식 사용


-- 또는


-- 실습 : 사번, 급여, 급여가 500만원 이상이면 '고급', 
-- 300~500 이면 '중급',
-- 그 이하는 '초급' 으로 출력 처리 : 별칭 '구분'


11번까지

